In [2]:
import numpy as np
import pandas as pd

# Series

In [3]:
# creating a list of prices of different medicines
med_price_list = [55, 25, 75, 40, 90]

# converting the med_price_list to an array
med_price_arr = np.array(med_price_list)

# converting the list and array into a Pandas Series object
series_list = pd.Series(med_price_list)
series_arr  = pd.Series(med_price_arr)

# printing the converted series object
print(series_list)
print(series_arr)

0    55
1    25
2    75
3    40
4    90
dtype: int64
0    55
1    25
2    75
3    40
4    90
dtype: int32

In [4]:
# printing the converted series object
print(type(series_list))
print(type(series_arr))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [5]:
# changing the index of a series
med_price_list_labeled = pd.Series(
    med_price_list,
    index=["Omeprazole", "Azithromycin", "Metformin", "Ibuprofen", "Cetirizine"])

print(med_price_list_labeled)

Omeprazole      55
Azithromycin    25
Metformin       75
Ibuprofen       40
Cetirizine      90
dtype: int64

In [6]:
# changing the index of a series
med_price_list_labeled = pd.Series(
    med_price_arr,
    index=["Omeprazole", "Azithromycin", "Metformin", "Ibuprofen", "Cetirizine"])

print(med_price_list_labeled)

Omeprazole      55
Azithromycin    25
Metformin       75
Ibuprofen       40
Cetirizine      90
dtype: int32

In [7]:
med_price_list_labeled_updated = med_price_list_labeled + 2.5
med_price_list_labeled_updated

Omeprazole      57.5
Azithromycin    27.5
Metformin       77.5
Ibuprofen       42.5
Cetirizine      92.5
dtype: float64

In [8]:
new_price_list = [77, 45.5, 100, 50, 80]
new_price_list_labeled = pd.Series(
    new_price_list,
    index=["Omeprazole", "Azithromycin", "Metformin", "Ibuprofen", "Cetirizine"]
)
print(new_price_list_labeled)

Omeprazole       77.0
Azithromycin     45.5
Metformin       100.0
Ibuprofen        50.0
Cetirizine       80.0
dtype: float64

In [9]:
print("Difference between new price and old price : ")
print(new_price_list_labeled - med_price_list_labeled_updated)

Difference between new price and old price :
Omeprazole      19.5
Azithromycin    18.0
Metformin       22.5
Ibuprofen        7.5
Cetirizine     -12.5
dtype: float64

# DataFrames

In [10]:
student = ["Mary", "Peter", "Susan", "Toby", "Vishal"]
df1 = pd.DataFrame(student, columns=["Student"])
df1

  Student
0    Mary
1   Peter
2   Susan
3    Toby
4  Vishal

In [11]:
grades = ["B-", "A+", "A-", "B+", "C"]

df2 = pd.DataFrame({"Student" : student, "Grade": grades})
df2

  Student Grade
0    Mary    B-
1   Peter    A+
2   Susan    A-
3    Toby    B+
4  Vishal     C

In [12]:
year = pd.Series([2012, 2013, 2014, 2015, 2016, 2017, 2018])
energy_consumption = pd.Series([2152, 2196, 2217, 2194, 2172, 2180, 2258])

df3 = pd.DataFrame({"Year": year, "Energy_Consumption":energy_consumption})
df3

   Year  Energy_Consumption
0  2012                2152
1  2013                2196
2  2014                2217
3  2015                2194
4  2016                2172
5  2017                2180
6  2018                2258

In [13]:
np.random.randn(10)

array([ 0.60190969,  0.57358915, -1.34752168,  1.87776205, -0.13217694,
       -2.12595061, -0.72091823,  0.2354981 ,  1.10402667,  1.43670613])

In [14]:
np.random.randn(5,2)

array([[ 1.4077887 , -1.26237345],
       [-1.32398059,  1.36607595],
       [-0.79512089, -0.15377536],
       [ 0.72564366, -0.09439942],
       [-2.23236486, -1.53649058]])

In [15]:
np.random.randn(5,5,2)

array([[[ 0.26467001,  1.19771736],
        [-0.81013984, -0.91158594],
        [-1.27929421,  1.54753844],
        [-0.03869572,  0.56619531],
        [-0.01092873, -0.58763309]],

       [[ 0.63290603,  1.10239635],
        [-2.15822503, -0.99322366],
        [ 0.45559614, -0.92706563],
        [ 0.57753999,  0.06430078],
        [-0.38172567,  0.23261303]],

       [[ 0.27377308,  0.00509107],
        [-0.00941152,  0.06778494],
        [ 0.67847727,  0.42602999],
        [ 0.4765186 ,  0.26842739],
        [-1.06136583,  1.01222892]],

       [[ 0.18395527, -0.20235679],
        [-1.60355525,  0.01890259],
        [-0.82766847, -0.61681163],
        [ 0.48594852, -0.47662733],
        [-0.65970135, -2.06627097]],

       [[-0.13785541,  0.18629858],
        [ 0.40936954, -0.02591982],
        [-2.38703387, -1.10032119],
        [ 2.28294376, -0.17706603],
        [ 0.15175   , -0.15711269]]])

In [16]:
df4 = pd.DataFrame(np.random.randn(5,2), columns=["Trial 1", "Trial 2"])
df4

    Trial 1   Trial 2
0 -1.136759 -1.490787
1 -0.088067 -0.177635
2  0.768786  0.200435
3  0.046133 -0.933948
4 -1.824580 -1.878021

In [17]:
df5 = pd.DataFrame(np.random.randn(5,2))
df5

          0         1
0 -0.054365 -0.423183
1 -1.988547 -0.124568
2 -0.202750 -1.004494
3 -0.831039  0.954468
4  0.310988  1.071220

In [18]:
df6 = pd.DataFrame(np.random.randn(5,2), columns=["Trial 1", "Trial 2"], index=["Omeprazole", "Azithromycin", "Metformin", "Ibuprofen", "Cetirizine"])
df6

               Trial 1   Trial 2
Omeprazole   -0.850432 -0.673677
Azithromycin  1.034323 -2.123499
Metformin    -0.105914  0.025207
Ibuprofen    -0.429641  0.508620
Cetirizine    0.661326 -1.209015

In [19]:
df6[2:4]

            Trial 1   Trial 2
Metformin -0.105914  0.025207
Ibuprofen -0.429641  0.508620

In [20]:
df6[:3]

               Trial 1   Trial 2
Omeprazole   -0.850432 -0.673677
Azithromycin  1.034323 -2.123499
Metformin    -0.105914  0.025207

In [21]:
operators = ["AT&T", "Verizon", "T-Mobile US", "US Cellular"]
revenue = [171.76, 128.29, 68.4, 4.04]

telcom = pd.Series(revenue, index=operators)
telcom

AT&T           171.76
Verizon        128.29
T-Mobile US     68.40
US Cellular      4.04
dtype: float64

In [22]:
operators = ["AT&T", "Verizon", "T-Mobile US", "US Cellular"]
revenue = [171.76, 128.29, 68.4, 4.04]

telcom1 = pd.Series(revenue, ["Test"])
telcom1

ValueError: Length of values (4) does not match length of index (1)

In [ ]:
operators = ["AT&T", "Verizon", "T-Mobile US", "US Cellular"]
revenue = [171.76, 128.29, 68.4, 4.04]

telcom1 = pd.Series(revenue, operators)
telcom1

In [23]:
telcom[0]

C:\Users\Ravi\AppData\Local\Temp\ipykernel_15172\1906483855.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  telcom[0]

171.76

In [24]:
telcom[:3]

AT&T           171.76
Verizon        128.29
T-Mobile US     68.40
dtype: float64

In [25]:
telcom[[0,2,3]]

C:\Users\Ravi\AppData\Local\Temp\ipykernel_15172\105444753.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  telcom[[0,2,3]]

AT&T           171.76
T-Mobile US     68.40
US Cellular      4.04
dtype: float64

In [26]:
telcom["AT&T"]

171.76

In [27]:
telcom[:"T-Mobile US"]

AT&T           171.76
Verizon        128.29
T-Mobile US     68.40
dtype: float64

In [28]:
# Creating DataFrame using dictionary

store_data = pd.DataFrame(
    {
        "CustomerID": ["CustID00", "CustID01", "CustID02", "CustID03", "CustID04"],
        "location": ["Chicago", "Boston", "Seattle", "San Francisco", "Austin"],
        "gender": ["M", "M", "F", "M", "F"],
        "type": [
            "Electronics",
            "Food&Beverages",
            "Food&Beverages",
            "Medicine",
            "Beauty"
        ],
        "quantity": [1, 3, 4, 2, 1],
        "Total_bill":[100, 75, 125, 50, 80]
    }
)

store_data

  CustomerID       location gender            type  quantity  Total_bill
0   CustID00        Chicago      M     Electronics         1         100
1   CustID01         Boston      M  Food&Beverages         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50
4   CustID04         Austin      F          Beauty         1          80

In [29]:
store_data[:1]

  CustomerID location gender         type  quantity  Total_bill
0   CustID00  Chicago      M  Electronics         1         100

In [30]:
store_data["location"]

0          Chicago
1           Boston
2          Seattle
3    San Francisco
4           Austin
Name: location, dtype: object

In [31]:
np.array(store_data["location"])

array(['Chicago', 'Boston', 'Seattle', 'San Francisco', 'Austin'],
      dtype=object)

In [32]:
store_data

  CustomerID       location gender            type  quantity  Total_bill
0   CustID00        Chicago      M     Electronics         1         100
1   CustID01         Boston      M  Food&Beverages         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50
4   CustID04         Austin      F          Beauty         1          80

In [33]:
store_data.loc[1]

CustomerID          CustID01
location              Boston
gender                     M
type          Food&Beverages
quantity                   3
Total_bill                75
Name: 1, dtype: object

In [34]:
store_data.loc[1,:]

CustomerID          CustID01
location              Boston
gender                     M
type          Food&Beverages
quantity                   3
Total_bill                75
Name: 1, dtype: object

In [35]:
store_data.loc[[1]]

  CustomerID location gender            type  quantity  Total_bill
1   CustID01   Boston      M  Food&Beverages         3          75

In [36]:
store_data.loc[[1,4],["location", "type"]]

  location            type
1   Boston  Food&Beverages
4   Austin          Beauty

In [37]:
store_data.iloc[[1,4],[1, 3]]

  location            type
1   Boston  Food&Beverages
4   Austin          Beauty

In [147]:
store_data.loc[[1,4],["location", "type"]]

  location         type
1   Boston  Electronics
4   Austin       Beauty

In [39]:
store_data.iloc[1,4]

3

In [40]:
store_data.iloc[1,3]

'Food&Beverages'

In [41]:
store_data.iloc[1,3] = 'Electronics'

In [42]:
store_data.iloc[1,3]

'Electronics'

In [43]:
store_data

  CustomerID       location gender            type  quantity  Total_bill
0   CustID00        Chicago      M     Electronics         1         100
1   CustID01         Boston      M     Electronics         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50
4   CustID04         Austin      F          Beauty         1          80

In [45]:
store_data.sort_values('Total_bill')

  CustomerID       location gender            type  quantity  Total_bill
3   CustID03  San Francisco      M        Medicine         2          50
1   CustID01         Boston      M     Electronics         3          75
4   CustID04         Austin      F          Beauty         1          80
0   CustID00        Chicago      M     Electronics         1         100
2   CustID02        Seattle      F  Food&Beverages         4         125

In [46]:
store_data.sort_values('Total_bill',ascending=False)

  CustomerID       location gender            type  quantity  Total_bill
2   CustID02        Seattle      F  Food&Beverages         4         125
0   CustID00        Chicago      M     Electronics         1         100
4   CustID04         Austin      F          Beauty         1          80
1   CustID01         Boston      M     Electronics         3          75
3   CustID03  San Francisco      M        Medicine         2          50

In [48]:
store_data.sort_values(['quantity','Total_bill'])

  CustomerID       location gender            type  quantity  Total_bill
4   CustID04         Austin      F          Beauty         1          80
0   CustID00        Chicago      M     Electronics         1         100
3   CustID03  San Francisco      M        Medicine         2          50
1   CustID01         Boston      M     Electronics         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125

In [51]:
store_data['Rank'] = store_data['Total_bill'].rank(ascending=False) # will return avarage of rank if multiple values are same

# parameter method = [min,max,dense] can be used for minimum, maximum or dense ranking

In [52]:
store_data

  CustomerID       location gender            type  quantity  Total_bill  Rank
0   CustID00        Chicago      M     Electronics         1         100   2.0
1   CustID01         Boston      M     Electronics         3          75   4.0
2   CustID02        Seattle      F  Food&Beverages         4         125   1.0
3   CustID03  San Francisco      M        Medicine         2          50   5.0
4   CustID04         Austin      F          Beauty         1          80   3.0

# Join DataFrames

3 methods for combining DataFrames
    1. concat
    2. join
    3. merge

In [117]:
data_cust = pd.DataFrame(
    {
        "customerID" : ["101", "102", "103", "104"],
        "category" : ["Medium", "Medium", "High", "Low"],
        "first_visit" : ["yes", "no", "yes", "yes"],
        "sales": [123,52,214,663]
    },
    index=[0,1,2,3]
)


data_cust_new = pd.DataFrame(
    {
        "customerID" : ["101", "103", "104", "105"],
        "distance" : [12, 9, 44, 21],
        "sales": [123,214,663,331]
    },
    index=[0,2,3,4]#[4,5,6]
)

In [149]:
data_cust

  customerID category first_visit  sales
0        101   Medium         yes    123
1        102   Medium          no     52
2        103     High         yes    214
3        104      Low         yes    663

In [73]:
data_cust_new

  customerID  distance  sales
4        101        12    123
5        103         9    214
6        104        44    663
7        105        21    331

In [74]:
pd.concat([data_cust, data_cust_new], axis=0)

  customerID category first_visit  sales  distance
0        101   Medium         yes    123       NaN
1        102   Medium          no     52       NaN
2        103     High         yes    214       NaN
3        104      Low         yes    663       NaN
4        101      NaN         NaN    123      12.0
5        103      NaN         NaN    214       9.0
6        104      NaN         NaN    663      44.0
7        105      NaN         NaN    331      21.0

In [75]:
pd.concat([data_cust, data_cust_new], axis=1)

  customerID category first_visit  sales customerID  distance  sales
0        101   Medium         yes  123.0        NaN       NaN    NaN
1        102   Medium          no   52.0        NaN       NaN    NaN
2        103     High         yes  214.0        NaN       NaN    NaN
3        104      Low         yes  663.0        NaN       NaN    NaN
4        NaN      NaN         NaN    NaN        101      12.0  123.0
5        NaN      NaN         NaN    NaN        103       9.0  214.0
6        NaN      NaN         NaN    NaN        104      44.0  663.0
7        NaN      NaN         NaN    NaN        105      21.0  331.0

In [76]:
pd.concat([data_cust, data_cust_new])

  customerID category first_visit  sales  distance
0        101   Medium         yes    123       NaN
1        102   Medium          no     52       NaN
2        103     High         yes    214       NaN
3        104      Low         yes    663       NaN
4        101      NaN         NaN    123      12.0
5        103      NaN         NaN    214       9.0
6        104      NaN         NaN    663      44.0
7        105      NaN         NaN    331      21.0

In [113]:
pd.merge( data_cust, data_cust_new, how="outer", on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes    123.0      12.0    123.0
1        102   Medium          no     52.0       NaN      NaN
2        103     High         yes    214.0       9.0    214.0
3        104      Low         yes    663.0      44.0    663.0
4        105      NaN         NaN      NaN      21.0    331.0

In [118]:
pd.merge( data_cust, data_cust_new, how="outer", on=["customerID","sales"])

  customerID category first_visit  sales  distance
0        101   Medium         yes    123      12.0
1        102   Medium          no     52       NaN
2        103     High         yes    214       9.0
3        104      Low         yes    663      44.0
4        105      NaN         NaN    331      21.0

In [125]:
outer = pd.merge( data_cust, data_cust_new, how='outer')  # Do not mention the columns, and it will join all all the columns which is common in both
outer

  customerID category first_visit  sales  distance
0        101   Medium         yes    123      12.0
1        102   Medium          no     52       NaN
2        103     High         yes    214       9.0
3        104      Low         yes    663      44.0
4        105      NaN         NaN    331      21.0

In [123]:
pd.merge( data_cust, data_cust_new)   # By default it joins data using inner join

  customerID category first_visit  sales  distance
0        101   Medium         yes    123        12
1        103     High         yes    214         9
2        104      Low         yes    663        44

In [78]:
pd.merge( data_cust, data_cust_new, how="inner", on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes      123        12      123
1        103     High         yes      214         9      214
2        104      Low         yes      663        44      663

In [27]:
pd.merge( data_cust, data_cust_new, how="right", on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes    123.0        12      123
1        103     High         yes    214.0         9      214
2        104      Low         yes    663.0        44      663
3        105      NaN         NaN      NaN        21      331

In [28]:
pd.merge( data_cust, data_cust_new, how="left", on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes      123      12.0    123.0
1        102   Medium          no       52       NaN      NaN
2        103     High         yes      214       9.0    214.0
3        104      Low         yes      663      44.0    663.0

In [126]:
outer.isna().sum()

customerID     0
category       1
first_visit    1
sales          0
distance       1
dtype: int64

In [127]:
outer['distance'].fillna(outer['distance'].mean())

0    12.0
1    21.5
2     9.0
3    44.0
4    21.0
Name: distance, dtype: float64

In [128]:
outer['distance'].sum()

86.0

In [130]:
outer['distance'].agg(['sum','min','max','mean'])

sum     86.0
min      9.0
max     44.0
mean    21.5
Name: distance, dtype: float64

In [134]:
outer.agg({
    'distance': ['sum','mean'],
    'sales': 'mean'
})

      distance  sales
sum       86.0    NaN
mean      21.5  276.6

In [135]:
outer.groupby('category')['sales'].mean()

category
High      214.0
Low       663.0
Medium     87.5
Name: sales, dtype: float64

In [138]:
outer.groupby('category')['sales'].agg('sum')

category
High      214
Low       663
Medium    175
Name: sales, dtype: int64

In [139]:
outer.groupby('category')[['sales','distance']].agg(['sum','mean'])

         sales        distance
           sum   mean      sum  mean
category
High       214  214.0      9.0   9.0
Low        663  663.0     44.0  44.0
Medium     175   87.5     12.0  12.0

In [140]:
data_quarters = pd.DataFrame(
    {"Q1": [101,102,103], "Q2": [201, 202, 203]}, index=["I0", "I1", "I2"]
)
data_quarters_new = pd.DataFrame(
    {"Q3": [301, 302, 303], "Q4": [401, 402, 403]}, index=["I0", "I2", "I3"]
)

In [141]:
data_quarters

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

In [142]:
data_quarters_new

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403

In [143]:
data_quarters.join(
    data_quarters_new, how="right"
)

       Q1     Q2   Q3   Q4
I0  101.0  201.0  301  401
I2  103.0  203.0  302  402
I3    NaN    NaN  303  403

In [145]:
data_cust.head()

  customerID category first_visit  sales
0        101   Medium         yes    123
1        102   Medium          no     52
2        103     High         yes    214
3        104      Low         yes    663

In [35]:
data_cust.tail()

  customerID category first_visit  sales
0        101   Medium         yes    123
1        102   Medium          no     52
2        103     High         yes    214
3        104      Low         yes    663

In [36]:
data_cust.shape

(4, 4)

In [37]:
data_cust.info

<bound method DataFrame.info of   customerID category first_visit  sales
0        101   Medium         yes    123
1        102   Medium          no     52
2        103     High         yes    214
3        104      Low         yes    663>

In [38]:
data_cust.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customerID   4 non-null      object
 1   category     4 non-null      object
 2   first_visit  4 non-null      object
 3   sales        4 non-null      int64
dtypes: int64(1), object(3)
memory usage: 332.0+ bytes

In [39]:
data_cust.dtypes

customerID     object
category       object
first_visit    object
sales           int64
dtype: object

In [40]:
data_cust.dtypes()

TypeError: 'Series' object is not callable